using System;

/*
 * Создайте коллекцию строковых элементов. В цикле на 5 итераций 
 * попросите пользователя заполнить коллекцию строками либо русского текста,
 * либо английского (просто смена раскладки без смысла слов). Предполагается,
 * что на каждой итерации ввести можно только слова, без учета пробелов,
 * и буквами только одной из двух раскладок.
 * Создайте метод, определяющий язык полученной строки. 
 * Создайте другой метод, принимающий коллекцию строковых элементов 
 * и выводящий на экран каждую из строк коллекции с комментарием – на каком языке введена строка.
*/

namespace Geneics7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
